ahmedaref-1/STM32F103C6-Drivers/MCAL/includes/STM32F103C6_REGISTERS.h
/*
 * STM32F103C6_REGISTERS.h
 *
 *  Created on: Jul 25, 2023
 *      Author: Ahmed Aref Omaira
 */

#ifndef STM32F103C6_REGISTERS_H_
#define STM32F103C6_REGISTERS_H_
/******************************************
 *                                        *
 *                INCLUDES                *
 * 										  *
 * ****************************************/
#include <stdint.h>
#include <stdlib.h>



/******************************************
 *                                        *
 *        MEMORIES BASE ADDRESSES         *
 *                                        *
 ******************************************/
#define FLASH_MEMORY_BASE                         0x08000000UL
#define SYSTEM_MEMORY_BASE                        0x1FFFF000UL
#define SRAM_MEMORY_BASE                          0x20000000UL
#define PERIPHERALS_BASE                          0x40000000UL
#define CORTEX_M3_INTERNAL_PERIPHERALS_BASE       0xE0000000UL


/******************************************
 *                                        *
 *     BUS PERIPHERALS BASE ADDRESSES     *
 *                                        *
 ******************************************/

/******************************************
 *     CORE PERIPHERALS BASE ADDRESSES    *
 * ****************************************/
#define NVIC_BASE                                (CORTEX_M3_INTERNAL_PERIPHERALS_BASE + 0x0000E100UL)

/******************************************
 *   AHB BUS PERIPHERALS BASE ADDRESSES   *
 * ****************************************/
#define RCC_BASE                                   0x40021000UL

/******************************************
 *  APB1 BUS PERIPHERALS BASE ADDRESSES   *
 * ****************************************/

/******************************************
 *  APB2 BUS PERIPHERALS BASE ADDRESSES   *
 * ****************************************/
#define GPIOA_BASE                               	0x40010800UL
#define GPIOB_BASE                             	    0x40010C00UL
#define GPIOC_BASE                                  0x40011000UL
#define GPIOD_BASE                                  0x40011400UL
#define GPIOE_BASE                                  0x40011800UL
#define EXTI_BASE                                   0x40010400UL
#define AFIO_BASE                                   0x40010000UL


/*********************************************
 *                                           *
 *     PERIPHERALS REGISTERS BASE ADDRESSES  *
 *                                           *
 *********************************************/

/****************************************************************
 *  NESTED VECTOR INTERRUPT CONTROLLER REGISTERS BASE ADDRESSES *
 * **************************************************************/

// Interrupt set-enable registers (NVIC_ISERx)
typedef struct{
	volatile uint32_t NVIC_ISER0;
	volatile uint32_t NVIC_ISER1;
	volatile uint32_t NVIC_ISER2;
}NVIC_ISER_t;
#define NVIC_ISER                ((volatile NVIC_ISER_t *)(NVIC_BASE + 0x00))

// Interrupt clear-enable registers (NVIC_ICERx)
typedef struct{
	volatile uint32_t NVIC_ICER0;
	volatile uint32_t NVIC_ICER1;
	volatile uint32_t NVIC_ICER2;
}NVIC_ICER_t;
#define NVIC_ICER                ((volatile NVIC_ICER_t *)(NVIC_BASE + 0x80))

// Interrupt set-pending registers (NVIC_ISPRx)
typedef struct{
	volatile uint32_t NVIC_ISPR0;
	volatile uint32_t NVIC_ISPR1;
	volatile uint32_t NVIC_ISPR2;
}NVIC_ISPR_t;
#define NVIC_ISPR                ((volatile NVIC_ISPR_t *)(NVIC_BASE + 0x100))

// Interrupt clear-pending registers (NVIC_ICPRx)
typedef struct{
	volatile uint32_t NVIC_ICPR0;
	volatile uint32_t NVIC_ICPR1;
	volatile uint32_t NVIC_ICPR2;
}NVIC_ICPR_t;
#define NVIC_ICPR                ((volatile NVIC_ICPR_t *)(NVIC_BASE + 0x180))

// Interrupt active bit registers (NVIC_IABRx)
typedef struct{
	volatile uint32_t NVIC_IABR0;
	volatile uint32_t NVIC_IABR1;
	volatile uint32_t NVIC_IABR2;
}NVIC_IABR_t;
#define NVIC_IABR                ((volatile NVIC_IABR_t *)(NVIC_BASE + 0x200))

// Interrupt priority registers (NVIC_IPRx)
typedef struct{
	volatile uint32_t NVIC_IPR[21];
}NVIC_IPR_t;
#define NVIC_IPR                 ((volatile NVIC_IPR_t *)(NVIC_BASE + 0x300))

// Software trigger interrupt register (NVIC_STIR)
#define NVIC_STIR                ((volatile uint32_t   *)(NVIC_BASE + 0xE00))


/**********************************************************
 *  RESET AND CONTROL PERIPHERAL REGISTERS BASE ADDRESSES *
 * ********************************************************/
/*********** RCC Registers' Bits ***********/
//TRM @ Section 7.3.11 on page 121

// Clock control register (RCC_CR)
typedef union{
	volatile uint32_t CR;
	struct{
		volatile uint32_t HSION		:1;
		volatile uint32_t HSIRDY	:1;
		volatile uint32_t Reserved	:1;
		volatile uint32_t HSITRIM	:5;
		volatile uint32_t HSICAL	:8;
		volatile uint32_t HSEON		:1;
		volatile uint32_t HSERDY	:1;
		volatile uint32_t HSEBYP	:1;
		volatile uint32_t CSSON		:1;
		volatile uint32_t Reserved0 :4;
		volatile uint32_t PLLON		:1;
		volatile uint32_t PLLRDY	:1;
		volatile uint32_t Reserved1	:6;
	};
}RCC_CR_t;

// Clock configuration register (RCC_CFGR)
typedef union{
	volatile uint32_t CFGR;
	struct{
		volatile uint32_t SW		:2;
		volatile uint32_t SWS		:2;
		volatile uint32_t HPRE		:4;
		volatile uint32_t PPRE1		:3;
		volatile uint32_t PPRE2		:3;
		volatile uint32_t ADCPRE	:2;
		volatile uint32_t PLLSRC	:1;
		volatile uint32_t PLLXTPRE	:1;
		volatile uint32_t PLLMUL	:4;
		volatile uint32_t USBPRE	:1;
		volatile uint32_t Res		:1;
		volatile uint32_t MCO		:3;
		volatile uint32_t Reserved	:5;
	};
}RCC_CFGR_t;

// Clock interrupt register (RCC_CIR)
typedef union{
	volatile uint32_t CIR;
	struct{
		volatile uint32_t LSIRDYF	:1;
		volatile uint32_t LSERDYF	:1;
		volatile uint32_t HSIRDYF	:1;
		volatile uint32_t HSERDYF	:1;
		volatile uint32_t PLLRDYF	:1;
		volatile uint32_t Reserved	:2;
		volatile uint32_t CSSF		:1;
		volatile uint32_t LSIRDYIE	:1;
		volatile uint32_t LSERDYIE	:1;
		volatile uint32_t HSIRDYIE	:1;
		volatile uint32_t HSERDYIE	:1;
		volatile uint32_t PLLRDYIE	:1;
		volatile uint32_t Reserved1	:3;
		volatile uint32_t LSIRDYC	:1;
		volatile uint32_t LSERDYC	:1;
		volatile uint32_t HSIRDYC	:1;
		volatile uint32_t HSERDYC	:1;
		volatile uint32_t PLLRDYC	:1;
		volatile uint32_t Reserved2	:2;
		volatile uint32_t CSSC		:1;
		volatile uint32_t Reserved3	:8;
	};
}RCC_CIR_t;

// APB2 peripheral reset register (RCC_APB2RSTR)
typedef union{
	volatile uint32_t APB2RSTR;
	struct{
		volatile uint32_t AFIORST	:1;
		volatile uint32_t Reserved	:1;
		volatile uint32_t IOPARST	:1;
		volatile uint32_t IOPBRST	:1;
		volatile uint32_t IOPCRST	:1;
		volatile uint32_t IOPDRST	:1;
		volatile uint32_t IOPERST	:1;
		volatile uint32_t IOPFRST	:1;
		volatile uint32_t IOPGRST	:1;
		volatile uint32_t ADC1RST	:1;
		volatile uint32_t ADC2RST	:1;
		volatile uint32_t TIM1RST	:1;
		volatile uint32_t SPI1RST	:1;
		volatile uint32_t TIM8RST	:1;
		volatile uint32_t USART1RST	:1;
		volatile uint32_t ADC3RST	:1;
		volatile uint32_t Reserved1	:3;
		volatile uint32_t TIM9RST	:1;
		volatile uint32_t TIM10RST	:1;
		volatile uint32_t TIM11RST	:1;
		volatile uint32_t Reserved2	:10;
	};
}RCC_APB2RSTR_t;

// APB1 peripheral reset register (RCC_APB1RSTR)
typedef union{
	volatile uint32_t APB1RSTR;
	struct{
		volatile uint32_t TIM2RST	:1;
		volatile uint32_t TIM3RST	:1;
		volatile uint32_t TIM4RST	:1;
		volatile uint32_t TIM5RST	:1;
		volatile uint32_t TIM6RST	:1;
		volatile uint32_t TIM7RST	:1;
		volatile uint32_t TIM12RST	:1;
		volatile uint32_t TIM13RST	:1;
		volatile uint32_t TIM14RST	:1;
		volatile uint32_t Reserved	:2;
		volatile uint32_t WWDGRST	:1;
		volatile uint32_t Reserved1	:2;
		volatile uint32_t SPI2RST	:1;
		volatile uint32_t SPI3RST	:1;
		volatile uint32_t Reserved2	:1;
		volatile uint32_t USART2RST	:1;
		volatile uint32_t USART3RST	:1;
		volatile uint32_t UART4RST	:1;
		volatile uint32_t UART5RST	:1;
		volatile uint32_t I2C1RST	:1;
		volatile uint32_t I2C2RST	:1;
		volatile uint32_t USBRST	:1;
		volatile uint32_t Reserved3	:1;
		volatile uint32_t CANRST	:1;
		volatile uint32_t Reserved4	:1;
		volatile uint32_t BKPRST	:1;
		volatile uint32_t PWRRST	:1;
		volatile uint32_t DACRST	:1;
		volatile uint32_t Reserved5	:2;
	};
}RCC_APB1RSTR_t;

// AHB peripheral clock enable register (RCC_AHBENR)
typedef union{
	volatile uint32_t AHBENR;
	struct{
		volatile uint32_t DMA1EN	:1;
		volatile uint32_t DMA2EN	:1;
		volatile uint32_t SRAMEN	:1;
		volatile uint32_t Reserved	:1;
		volatile uint32_t FLITFEN	:1;
		volatile uint32_t Reserved1	:1;
		volatile uint32_t CRCEN		:1;
		volatile uint32_t Reserved2	:1;
		volatile uint32_t FSMCEN	:1;
		volatile uint32_t Reserved3	:1;
		volatile uint32_t SDIOEN	:1;
		volatile uint32_t Reserved4	:21;
	};
}RCC_AHBENR_t;

