ahmedaref-1/STM32F103C6-Drivers/MCAL/includes/STM32F103C6_REGISTERS.h
// APB2 peripheral clock enable register (RCC_APB2ENR)
typedef union{
	volatile uint32_t APB2ENR;
	struct{
		volatile uint32_t AFIOEN	:1;
		volatile uint32_t Reserved	:1;
		volatile uint32_t IOPAEN	:1;
		volatile uint32_t IOPBEN	:1;
		volatile uint32_t IOPCEN	:1;
		volatile uint32_t IOPDEN	:1;
		volatile uint32_t IOPEEN	:1;
		volatile uint32_t IOPFEN	:1;
		volatile uint32_t IOPGEN	:1;
		volatile uint32_t ADC1EN	:1;
		volatile uint32_t ADC2EN	:1;
		volatile uint32_t TIM1EN	:1;
		volatile uint32_t SPI1EN	:1;
		volatile uint32_t TIM8EN	:1;
		volatile uint32_t USART1EN	:1;
		volatile uint32_t ADC3EN	:1;
		volatile uint32_t Reserved1	:3;
		volatile uint32_t TIM9EN	:1;
		volatile uint32_t TIM10EN	:1;
		volatile uint32_t TIM11EN	:1;
		volatile uint32_t Reserved2	:10;
	};
}RCC_APB2ENR_t;

// APB1 peripheral clock enable register (RCC_APB1ENR)
typedef union{
	volatile uint32_t APB1ENR;
	struct{
		volatile uint32_t TIM2EN	:1;
		volatile uint32_t TIM3EN	:1;
		volatile uint32_t TIM4EN	:1;
		volatile uint32_t TIM5EN	:1;
		volatile uint32_t TIM6EN	:1;
		volatile uint32_t TIM7EN	:1;
		volatile uint32_t TIM12EN	:1;
		volatile uint32_t TIM13EN	:1;
		volatile uint32_t TIM14EN	:1;
		volatile uint32_t Reserved	:2;
		volatile uint32_t WWDGEN	:1;
		volatile uint32_t Reserved1	:2;
		volatile uint32_t SPI2EN	:1;
		volatile uint32_t SPI3EN	:1;
		volatile uint32_t Reserved2	:1;
		volatile uint32_t USART2EN	:1;
		volatile uint32_t USART3EN	:1;
		volatile uint32_t UART4REN	:1;
		volatile uint32_t UART5EN	:1;
		volatile uint32_t I2C1EN	:1;
		volatile uint32_t I2C2EN	:1;
		volatile uint32_t USBEN		:1;
		volatile uint32_t Reserved3	:1;
		volatile uint32_t CANEN		:1;
		volatile uint32_t Reserved4	:1;
		volatile uint32_t BKPEN		:1;
		volatile uint32_t PWREN		:1;
		volatile uint32_t DACEN		:1;
		volatile uint32_t Reserved5	:2;
	};
}RCC_APB1ENR_t;

// Backup domain control register (RCC_BDCR)
typedef union{
	volatile uint32_t BDCR;
	struct{
		volatile uint32_t LSEON		:1;
		volatile uint32_t LSERDY	:1;
		volatile uint32_t LSEBYP	:1;
		volatile uint32_t Reserved	:5;
		volatile uint32_t RTCSEL	:2;
		volatile uint32_t Reserved1	:5;
		volatile uint32_t RTCEN		:1;
		volatile uint32_t BDRST		:1;
		volatile uint32_t Reserved2	:15;
	};
}RCC_BDCR_t;

// Control/status register (RCC_CSR)
typedef union{
	volatile uint32_t CSR;
	struct{
		volatile uint32_t LSION		:1;
		volatile uint32_t LSIRDY	:1;
		volatile uint32_t Reserved	:22;
		volatile uint32_t RMVF		:1;
		volatile uint32_t Reserved1	:1;
		volatile uint32_t PINRSTF	:1;
		volatile uint32_t PORRSTF	:1;
		volatile uint32_t SETRSTF	:1;
		volatile uint32_t IWDGRSTF	:1;
		volatile uint32_t WWDGRSTF	:1;
		volatile uint32_t LPWRRSTF	:1;
	};
}RCC_CSR_t;

/*********** RCC REGISTERS ***************/
typedef struct{
	volatile RCC_CR_t 		CR;
	volatile RCC_CFGR_t 	CFGR;
	volatile RCC_CIR_t  	CIR;
	volatile RCC_APB2RSTR_t APB2RSTR;
	volatile RCC_APB1RSTR_t APB1RSTR;
	volatile RCC_AHBENR_t 	AHBENR;
	volatile RCC_APB2ENR_t 	APB2ENR;
	volatile RCC_APB1ENR_t 	APB1ENR;
	volatile RCC_BDCR_t 	BDCR;
	volatile RCC_CSR_t 		CSR;
}RCC_t;

/***********************************************
 *   GPIO PREIPHERAL REGISTERS BASE ADDRESSES  *
 * *********************************************/
/************ GPIO Registers' Bits ***********/
//TRM @ Section 9.5 on page 194
// Port configuration register low (GPIOx_CRL) (x=A..G)
typedef union{
	volatile uint32_t CRL;
	struct{
		volatile uint32_t MODE0	:2;
		volatile uint32_t  CNF0	:2;
		volatile uint32_t MODE1	:2;
		volatile uint32_t  CNF1	:2;
		volatile uint32_t MODE2	:2;
		volatile uint32_t  CNF2	:2;
		volatile uint32_t MODE3	:2;
		volatile uint32_t  CNF3	:2;
		volatile uint32_t MODE4	:2;
		volatile uint32_t  CNF4	:2;
		volatile uint32_t MODE5	:2;
		volatile uint32_t  CNF5	:2;
		volatile uint32_t MODE6	:2;
		volatile uint32_t  CNF6	:2;
		volatile uint32_t MODE7	:2;
		volatile uint32_t  CNF7	:2;
	};
}GPIOx_CRL_t;

// Port configuration register high (GPIOx_CRH) (x=A..G)
typedef union{
	volatile uint32_t CRH;
	struct{
		volatile uint32_t  MODE8 :2;
		volatile uint32_t   CNF8 :2;
		volatile uint32_t  MODE9 :2;
		volatile uint32_t   CNF9 :2;
		volatile uint32_t MODE10 :2;
		volatile uint32_t  CNF10 :2;
		volatile uint32_t MODE11 :2;
		volatile uint32_t  CNF11 :2;
		volatile uint32_t MODE12 :2;
		volatile uint32_t  CNF12 :2;
		volatile uint32_t MODE13 :2;
		volatile uint32_t  CNF13 :2;
		volatile uint32_t MODE14 :2;
		volatile uint32_t  CNF14 :2;
		volatile uint32_t MODE15 :2;
		volatile uint32_t  CNF15 :2;
	};
}GPIOx_CRH_t;

// Port input data register (GPIOx_IDR) (x=A..G)
typedef union{
	volatile uint32_t IDR;
	struct{
		volatile uint32_t PIN_0		:1;
		volatile uint32_t PIN_1		:1;
		volatile uint32_t PIN_2		:1;
		volatile uint32_t PIN_3		:1;
		volatile uint32_t PIN_4		:1;
		volatile uint32_t PIN_5		:1;
		volatile uint32_t PIN_6		:1;
		volatile uint32_t PIN_7		:1;
		volatile uint32_t PIN_8		:1;
		volatile uint32_t PIN_9		:1;
		volatile uint32_t PIN_10	:1;
		volatile uint32_t PIN_11	:1;
		volatile uint32_t PIN_12	:1;
		volatile uint32_t PIN_13	:1;
		volatile uint32_t PIN_14	:1;
		volatile uint32_t PIN_15	:1;
		volatile uint32_t Reserved	:16;
	};
}GPIOx_IDR_t;

// Port output data register (GPIOx_ODR) (x=A..G)
typedef union{
	volatile uint32_t ODR;
	struct{
		volatile uint32_t PIN_0		:1;
		volatile uint32_t PIN_1		:1;
		volatile uint32_t PIN_2		:1;
		volatile uint32_t PIN_3		:1;
		volatile uint32_t PIN_4		:1;
		volatile uint32_t PIN_5		:1;
		volatile uint32_t PIN_6		:1;
		volatile uint32_t PIN_7		:1;
		volatile uint32_t PIN_8		:1;
		volatile uint32_t PIN_9		:1;
		volatile uint32_t PIN_10	:1;
		volatile uint32_t PIN_11	:1;
		volatile uint32_t PIN_12	:1;
		volatile uint32_t PIN_13	:1;
		volatile uint32_t PIN_14	:1;
		volatile uint32_t PIN_15	:1;
		volatile uint32_t Reserved	:16;
	};
}GPIOx_ODR_t;

// Port bit set/reset register (GPIOx_BSRR) (x=A..G)
typedef union{
	volatile uint32_t BSRR;
	struct{
		volatile uint32_t BS	:16;
		volatile uint32_t BR	:16;
	};
}GPIOx_BSRR_t;

// Port bit reset register (GPIOx_BRR) (x=A..G)
typedef union{
	volatile uint32_t BRR;
	struct{
		volatile uint32_t BR		:16;
		volatile uint32_t Reserved	:16;
	};
}GPIOx_BRR_t;

// Port configuration lock register (GPIOx_LCKR) (x=A..G)
typedef union{
	volatile uint32_t LCKR;
	struct{
		volatile uint32_t PIN_0		:1;
		volatile uint32_t PIN_1		:1;
		volatile uint32_t PIN_2		:1;
		volatile uint32_t PIN_3		:1;
		volatile uint32_t PIN_4		:1;
		volatile uint32_t PIN_5		:1;
		volatile uint32_t PIN_6		:1;
		volatile uint32_t PIN_7		:1;
		volatile uint32_t PIN_8		:1;
		volatile uint32_t PIN_9		:1;
		volatile uint32_t PIN_10	:1;
		volatile uint32_t PIN_11	:1;
		volatile uint32_t PIN_12	:1;
		volatile uint32_t PIN_13	:1;
		volatile uint32_t PIN_14	:1;
		volatile uint32_t PIN_15	:1;
		volatile uint32_t LCKK		:1;
		volatile uint32_t Reserved	:15;
	};
}GPIOx_LCKR_t;

/*********** GPIO Registers ***********/
typedef struct{
	GPIOx_CRL_t 	CRL;
	GPIOx_CRH_t 	CRH;
	GPIOx_IDR_t 	IDR;
	GPIOx_ODR_t 	ODR;
	GPIOx_BSRR_t 	BSRR;
	GPIOx_BRR_t 	BRR;
	GPIOx_LCKR_t 	LCKR;
}GPIO_t;

