ahmedaref-1/STM32F103C6-Drivers/MCAL/includes/STM32F103C6_REGISTERS.h
/*************************************************************
 *  EXTERNAL INTERRUPTS PERIPHERAL REGISTERS BASE ADDRESSES  *
 * ***********************************************************/
/*********** EXTI Registers' Bits ***********/
//TRM @ Section 10.3.7 on page 214
// Interrupt mask register (EXTI_IMR)
typedef union{
	volatile uint32_t IMR;
	struct{
		volatile uint32_t MR0		:1;
		volatile uint32_t MR1		:1;
		volatile uint32_t MR2		:1;
		volatile uint32_t MR3		:1;
		volatile uint32_t MR4		:1;
		volatile uint32_t MR5		:1;
		volatile uint32_t MR6		:1;
		volatile uint32_t MR7		:1;
		volatile uint32_t MR8		:1;
		volatile uint32_t MR9		:1;
		volatile uint32_t MR10		:1;
		volatile uint32_t MR11		:1;
		volatile uint32_t MR12		:1;
		volatile uint32_t MR13		:1;
		volatile uint32_t MR14		:1;
		volatile uint32_t MR15		:1;
		volatile uint32_t MR16		:1;
		volatile uint32_t MR17		:1;
		volatile uint32_t MR18		:1;
		volatile uint32_t MR19		:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_IMR_t;

// Event mask register (EXTI_EMR)
typedef union{
	volatile uint32_t EMR;
	struct{
		volatile uint32_t MR0		:1;
		volatile uint32_t MR1		:1;
		volatile uint32_t MR2		:1;
		volatile uint32_t MR3		:1;
		volatile uint32_t MR4		:1;
		volatile uint32_t MR5		:1;
		volatile uint32_t MR6		:1;
		volatile uint32_t MR7		:1;
		volatile uint32_t MR8		:1;
		volatile uint32_t MR9		:1;
		volatile uint32_t MR10		:1;
		volatile uint32_t MR11		:1;
		volatile uint32_t MR12		:1;
		volatile uint32_t MR13		:1;
		volatile uint32_t MR14		:1;
		volatile uint32_t MR15		:1;
		volatile uint32_t MR16		:1;
		volatile uint32_t MR17		:1;
		volatile uint32_t MR18		:1;
		volatile uint32_t MR19		:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_EMR_t;

// Rising trigger selection register (EXTI_RTSR)
typedef union{
	volatile uint32_t RTSR;
	struct{
		volatile uint32_t TR0		:1;
		volatile uint32_t TR1		:1;
		volatile uint32_t TR2		:1;
		volatile uint32_t TR3		:1;
		volatile uint32_t TR4		:1;
		volatile uint32_t TR5		:1;
		volatile uint32_t TR6		:1;
		volatile uint32_t TR7		:1;
		volatile uint32_t TR8		:1;
		volatile uint32_t TR9		:1;
		volatile uint32_t TR10		:1;
		volatile uint32_t TR11		:1;
		volatile uint32_t TR12		:1;
		volatile uint32_t TR13		:1;
		volatile uint32_t TR14		:1;
		volatile uint32_t TR15		:1;
		volatile uint32_t TR16		:1;
		volatile uint32_t TR17		:1;
		volatile uint32_t TR18		:1;
		volatile uint32_t TR19		:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_RTSR_t;

// Falling trigger selection register (EXTI_FTSR)
typedef union{
	volatile uint32_t FTSR;
	struct{
		volatile uint32_t TR0		:1;
		volatile uint32_t TR1		:1;
		volatile uint32_t TR2		:1;
		volatile uint32_t TR3		:1;
		volatile uint32_t TR4		:1;
		volatile uint32_t TR5		:1;
		volatile uint32_t TR6		:1;
		volatile uint32_t TR7		:1;
		volatile uint32_t TR8		:1;
		volatile uint32_t TR9		:1;
		volatile uint32_t TR10		:1;
		volatile uint32_t TR11		:1;
		volatile uint32_t TR12		:1;
		volatile uint32_t TR13		:1;
		volatile uint32_t TR14		:1;
		volatile uint32_t TR15		:1;
		volatile uint32_t TR16		:1;
		volatile uint32_t TR17		:1;
		volatile uint32_t TR18		:1;
		volatile uint32_t TR19		:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_FTSR_t;

// Software interrupt event register (EXTI_SWIER)
typedef union{
	volatile uint32_t SWIER;
	struct{
		volatile uint32_t _SWIER0	:1;
		volatile uint32_t _SWIER1	:1;
		volatile uint32_t _SWIER2	:1;
		volatile uint32_t _SWIER3	:1;
		volatile uint32_t _SWIER4	:1;
		volatile uint32_t _SWIER5	:1;
		volatile uint32_t _SWIER6	:1;
		volatile uint32_t _SWIER7	:1;
		volatile uint32_t _SWIER8	:1;
		volatile uint32_t _SWIER9	:1;
		volatile uint32_t _SWIER10	:1;
		volatile uint32_t _SWIER11	:1;
		volatile uint32_t _SWIER12	:1;
		volatile uint32_t _SWIER13	:1;
		volatile uint32_t _SWIER14	:1;
		volatile uint32_t _SWIER15	:1;
		volatile uint32_t _SWIER16	:1;
		volatile uint32_t _SWIER17	:1;
		volatile uint32_t _SWIER18	:1;
		volatile uint32_t _SWIER19	:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_SWIER_t;

// Pending register (EXTI_PR)
typedef union{
	volatile uint32_t PR;
	struct{
		volatile uint32_t _PR0		:1;
		volatile uint32_t _PR1		:1;
		volatile uint32_t _PR2		:1;
		volatile uint32_t _PR3		:1;
		volatile uint32_t _PR4		:1;
		volatile uint32_t _PR5		:1;
		volatile uint32_t _PR6		:1;
		volatile uint32_t _PR7		:1;
		volatile uint32_t _PR8		:1;
		volatile uint32_t _PR9		:1;
		volatile uint32_t _PR10		:1;
		volatile uint32_t _PR11		:1;
		volatile uint32_t _PR12		:1;
		volatile uint32_t _PR13		:1;
		volatile uint32_t _PR14		:1;
		volatile uint32_t _PR15		:1;
		volatile uint32_t _PR16		:1;
		volatile uint32_t _PR17		:1;
		volatile uint32_t _PR18		:1;
		volatile uint32_t _PR19		:1;
		volatile uint32_t Reserved	:12;
	};
}EXTI_PR_t;

/************* EXTI Registers ************/
typedef struct{
	volatile EXTI_IMR_t 	IMR;
	volatile EXTI_EMR_t 	EMR;
	volatile EXTI_RTSR_t 	RTSR;
	volatile EXTI_FTSR_t 	FTSR;
	volatile EXTI_SWIER_t 	SWIER;
	volatile EXTI_PR_t 		PR;
}EXTI_t;

/**********************************************************
 *      AFIO PERIPHERAL REGISTERS BASE ADDRESSES          *
 * ********************************************************/
/*********** AFIO Registers' Bits ***********/
//TRM @ Section 9.5 on page 194
// Event control register (AFIO_EVCR)
typedef union{
	volatile uint32_t EVCR;
	struct{
		volatile uint32_t PIN		:4;
		volatile uint32_t PORT		:3;
		volatile uint32_t EVOE		:1;
		volatile uint32_t Reserved	:24;
	};
}AFIO_EVCR_t;

// AF re-map and debug I/O configuration register (AFIO_MAPR)
// Memory map and bit definitions for low-, medium- high- and XL-density devices
typedef union{
	volatile uint32_t MAPR;
	struct{
		volatile uint32_t SPI1_REMAP			:1;
		volatile uint32_t I2C1_REMAP			:1;
		volatile uint32_t USART1_REMAP			:1;
		volatile uint32_t USART2_REMAP			:1;
		volatile uint32_t USART3_REMAP			:2;
		volatile uint32_t TIM1_REMAP			:2;
		volatile uint32_t TIM2_REMAP			:2;
		volatile uint32_t TIM3_REMAP			:2;
		volatile uint32_t TIM4_REMAP			:1;
		volatile uint32_t CAN_REMAP				:2;
		volatile uint32_t PD01_REMAP			:1;
		volatile uint32_t TIM5CH4_IREMAP		:1;
		volatile uint32_t ADC1_ETRGINJ_IREMAP	:1;
		volatile uint32_t ADC1_ETRGREG_REMAP	:1;
		volatile uint32_t ADC2_ETRGINJ_REMAP	:1;
		volatile uint32_t ADC2_ETRGREG_REMAP	:1;
		volatile uint32_t Reserved				:3;
		volatile uint32_t SWJ_CFG				:3;
		volatile uint32_t Reserved1				:5;
	};
}AFIO_MAPR_t;

// External interrupt configuration register x (AFIO_EXTICRx)
typedef union{
	volatile uint32_t EXTICR;
	struct{
		volatile uint32_t EXTI_0	:4;
		volatile uint32_t EXTI_1	:4;
		volatile uint32_t EXTI_2	:4;
		volatile uint32_t EXTI_3	:4;
		volatile uint32_t Reserved	:16;
	};
}AFIO_EXTICRx_t;

// AF re-map and debug I/O configuration register2 (AFIO_MAPR2)
typedef union{
	volatile uint32_t MAPR2;
	struct{
		volatile uint32_t Reserved		:5;
		volatile uint32_t TIM9_REMAP	:1;
		volatile uint32_t TIM10_REMAP	:1;
		volatile uint32_t TIM11_REMAP	:1;
		volatile uint32_t TIM13_REMAP	:1;
		volatile uint32_t TIM14_REMAP	:1;
		volatile uint32_t FSMC_NADV		:1;
		volatile uint32_t Reserved1		:21;
	};
}AFIO_MAPR2_t;

/*********** AFIO Register ***********/
typedef struct{
	AFIO_EVCR_t 		EVCR;
	AFIO_MAPR_t 		MAPR;
	AFIO_EXTICRx_t 		AFIO_EXTICR[4];
	volatile uint32_t 	Reserved;
	AFIO_MAPR2_t 		MAPR2;
}AFIO_t;


