ahmedaref-1/STM32F103C6-Drivers/MCAL/includes/STM32F103C6_REGISTERS.h
/*********************************************
 *                                           *
 *          PERIPHERALS INSTANCES            *
 *                                           *
 *********************************************/

#define GPIOA                              ((GPIO_t *)GPIOA_BASE)
#define GPIOB                              ((GPIO_t *)GPIOB_BASE)
#define GPIOC                              ((GPIO_t *)GPIOC_BASE)
#define GPIOD                              ((GPIO_t *)GPIOD_BASE)
#define GPIOE                              ((GPIO_t *)GPIOE_BASE)
#define RCC                                ((volatile RCC_t  *)RCC_BASE)
#define AFIO                               ((volatile AFIO_t *)AFIO_BASE)
#define EXTI                               ((volatile EXTI_t *)EXTI_BASE)


/*********************************************
 *                                           *
 *         CLOCK ENABLING MACROS             *
 *                                           *
 *********************************************/

#define RCC_GPIOA_CLOCK_EN()             (RCC->APB2ENR.IOPAEN=HIGH)
#define RCC_GPIOB_CLOCK_EN()             (RCC->APB2ENR.IOPBEN=HIGH)
#define RCC_GPIOC_CLOCK_EN()             (RCC->APB2ENR.IOPCEN=HIGH)
#define RCC_GPIOD_CLOCK_EN()             (RCC->APB2ENR.IOPDEN=HIGH)
#define RCC_GPIOE_CLOCK_EN()             (RCC->APB2ENR.IOPEEN=HIGH)
#define RCC_AFIO_CLOCK_EN()              (RCC->APB2ENR.AFIOEN=HIGH)


/*********************************************
 *                                           *
 *        EXTERNAL INTERRUPT MACROS          *
 *                                           *
 *********************************************/
// EXTI Line Number Macros
#define EXTI0                 (uint16_t)0
#define EXTI1                 (uint16_t)1
#define EXTI2                 (uint16_t)2
#define EXTI3                 (uint16_t)3
#define EXTI4                 (uint16_t)4
#define EXTI5                 (uint16_t)5
#define EXTI6                 (uint16_t)6
#define EXTI7                 (uint16_t)7
#define EXTI8                 (uint16_t)8
#define EXTI9                 (uint16_t)9
#define EXTI10                (uint16_t)10
#define EXTI11                (uint16_t)11
#define EXTI12                (uint16_t)12
#define EXTI13                (uint16_t)13
#define EXTI14                (uint16_t)14
#define EXTI15                (uint16_t)15

// EXTI Request Position Macros
#define EXTI0_IRQ             6
#define EXTI1_IRQ             7
#define EXTI2_IRQ             8
#define EXTI3_IRQ             9
#define EXTI4_IRQ             10
#define EXTI5_IRQ             23
#define EXTI6_IRQ             23
#define EXTI7_IRQ             23
#define EXTI8_IRQ             23
#define EXTI9_IRQ             23
#define EXTI9_5_IRQ           23
#define EXTI10_IRQ            40
#define EXTI11_IRQ            40
#define EXTI12_IRQ            40
#define EXTI13_IRQ            40
#define EXTI14_IRQ            40
#define EXTI15_IRQ            40
#define EXTI15_10_IRQ         40


/**********************************************
 *											  *
 *         COMMON MACROS DEFINITION           *
 *         									  *
 * ********************************************/
#define TRUE        1U
#define FALSE       0U
#define HIGH		1U
#define LOW 		0U
/*********** GLOBAL ENUM DEFINITION **********/
typedef enum{
	FAIL,
	SUCCESS
}Return_t;

#endif /* STM32F103C6_REGISTERS_H_ */
